Documents/РабочийЛистКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РабочийЛистКомиссии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаПоступления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоступлениеАвто</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СведенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СведенияКомпании</Name>
			<Comment>Некоторые сведения о компании которые могут измениться со временем (например гл. бухгалтер, руководитель...)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение сведения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоСтатусам</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:EnumRef.СтратегияСписанияПартийТоваровПоДатам</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Вид сведения</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСведений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИОГенеральногоДиректора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИОГенеральногоДиректора</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОбъектовСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовСведений</Name>
			<Comment>Виды объектов сведений</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
					<Comment>Руководитель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Comment>Главный бухгалтер</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассир</Name>
					<Comment>Кассир</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Материально ответственное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоДатам</Name>
					<Comment>Стратегия списания партий товаров по датам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтратегияСписанияПоСтатусам</Name>
					<Comment>Стратегия списания партий товаров по статусам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокПоставки</Name>
					<Comment>Срок поставки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РабочийЛистКомиссии/Ext/ObjectModule.bsl
Функция ПолучитьСтруктуру()	   
	ДатаДоговора = ?(ЗначениеЗаполнено(ПоступлениеАвто.ДоговорВзаиморасчетов.ДатаКП), ПоступлениеАвто.ДоговорВзаиморасчетов.ДатаКП, ПоступлениеАвто.Дата);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Номер", ?(ЗначениеЗаполнено(ПоступлениеАвто.ВхДокНомер), ПоступлениеАвто.ВхДокНомер, ПоступлениеАвто.Номер));
	СтруктураПараметров.Вставить("Дата", Формат(ДатаДоговора, "ДЛФ=Д") + " г.");  
	СтруктураПараметров.Вставить("Принципал", Контрагент.НаименованиеПолное);  
	
	СтруктураОтбора = Новый Структура("Организация, Объект", Организация, Перечисления.ВидыОбъектовСведений.Руководитель);
	СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(РабочаяДата, СтруктураОтбора);
	Руководитель = СтруктураСведений.Значение;
	СтруктураСведений = Неопределено;  
	
	// Холышевская ++ 20260204
	Подписант = ?( ЗначениеЗаполнено(ПоступлениеАвто.Подписант), ПоступлениеАвто.Подписант, ПараметрыСеанса.Пользователь.Сотрудник);
	ОбАгенте = СокрЛП(Организация.НаименованиеПолное);
    СтруктураПараметров.Вставить("ОбАгенте", ОбАгенте);

	// Холышевкая -- 20260204
	       
	Если Организация.ФормаСобственности	= Перечисления.ФормыСобственности.ЮридическоеЛицо Тогда
		
		ТекущаяДоверенность = СМ_ФормированиеНовыхОбъектов.ПолучитьДоверенность(Автор, Организация);
		
		Если ТекущаяДоверенность = Неопределено Тогда
			ВЛицеРуководителя = "Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
			НаОсновании = "Устава";			
		Иначе
			СтруктураОтбора = Новый Структура("Организация", Организация);
			СтруктураСведений = РегистрыСведений.ИОГенеральногоДиректора.ПолучитьПоследнее(Дата, СтруктураОтбора);
			
			Если СтруктураСведений <> Неопределено И ДатаДоговора >= СтруктураСведений.ДатаНачала И ДатаДоговора < КонецДня(СтруктураСведений.ДатаОкончания) Тогда
				Руководитель = СтруктураСведений.Значение;
				ВЛицеРуководителя = " и.о. Генерального директора " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
				ФормаВыбора = Справочники.ПодтверждающиеДокументы.ПолучитьФормуВыбора();
				ФормаВыбора.Заголовок = "Выбор доверенности для и.о. Генерального директора";
				ФормаВыбора.Отбор.Владелец.Значение = Руководитель;
				ФормаВыбора.Отбор.Владелец.Использование = Истина;
				ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Значение = Перечисления.ВидыДокументов.Доверенность;
				ФормаВыбора.Отбор.ВидПодтверждающегоДокумента.Использование = Истина;
				ПодтвДокументСсылка = ФормаВыбора.ОткрытьМодально();
				
				Если ЗначениеЗаполнено(ПодтвДокументСсылка) Тогда
					НаОсновании = "Доверенности от " + Формат(ПодтвДокументСсылка.ДатаВыдачи, "ДЛФ=Д");			
				КонецЕсли;	
				
			Иначе	
				ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.daСклонение(Автор.Сотрудник.Должность, 2) + " " + СМ_ФормированиеНовыхОбъектов.ПадежФИО(Автор.Наименование);
				НаОсновании = "Доверенности № " + ТекущаяДоверенность.Номер + " от " + Формат(ТекущаяДоверенность.ДатаВыдачи, "ДФ=dd.MM.yy");
				СтруктураПараметров.Вставить("ОснованиеПодписи", "по " + НаОсновании);
			КонецЕсли; 		
			
		КонецЕсли; 
		
	Иначе
		ВЛицеРуководителя = СМ_ФормированиеНовыхОбъектов.ПадежФИО(Руководитель.Наименование);
		НаОсновании = "Свидетельства";			
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ВЛице", ВЛицеРуководителя + ?(ЗначениеЗаполнено(НаОсновании), ", действующего на основании " + НаОсновании, ""));  
	
	ЗапросПД = Новый Запрос;
	ЗапросПД.Текст = 
	"ВЫБРАТЬ
	|	ПодтверждающиеДокументы.Серия КАК Серия,
	|	ПодтверждающиеДокументы.Номер КАК Номер,
	|	ПодтверждающиеДокументы.ДатаВыдачи КАК ДатаВыдачи,
	|	ПодтверждающиеДокументы.КемВыдан КАК КемВыдан,
	|	ПодтверждающиеДокументы.КодПодразделения КАК КодПодразделения
	|ИЗ
	|	Справочник.ПодтверждающиеДокументы КАК ПодтверждающиеДокументы
	|ГДЕ
	|	ПодтверждающиеДокументы.Владелец = &Владелец
	|	И ПодтверждающиеДокументы.ВидПодтверждающегоДокумента = &ВидПодтверждающегоДокумента
	|	И ПодтверждающиеДокументы.Текущий = ИСТИНА";
	ЗапросПД.УстановитьПараметр("Владелец", Контрагент); 
	ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Паспорт);
	// Холышевская ++ 20260127    
	// было
	// РезультатПД = Результат.Выполнить().Выбрать()
	// стало
	РезультатЗапросаПД = ЗапросПД.Выполнить(); 
	РезультатПД = РезультатЗапросаПД.Выбрать();  
	// Холышевская -- 20260127

	
	//Иванченко 20260112 ++ 
	//Если НЕ РезультатПД.Следующий() Тогда
	// Холышевская ++ 20260126
	Если РезультатЗапросаПД.Пустой() Тогда
	// Холышевская -- 20260126
		ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ВидНаЖительство);
		РезультатПД = ЗапросПД.Выполнить().Выбрать();
	КонецЕсли;	
	//Иванченко 20260112 --		
	
	Если РезультатПД.Следующий() Тогда	
		ПаспортСерия = РезультатПД.Серия;
		ПаспортНомер = РезультатПД.Номер; 
		ПаспортКемВыдан = РезультатПД.КемВыдан;
		ПаспортДатаВыдачи = Формат(РезультатПД.ДатаВыдачи, "ДЛФ=Д"); 
		ПаспортКодПодразделения = РезультатПД.КодПодразделения;
		СтруктураПараметров.Вставить("Паспорт", ПаспортСерия + " №" + ПаспортНомер + ", выдан " + ПаспортКемВыдан + ", дата выдачи " + ПаспортДатаВыдачи); 
		СтруктураПараметров.Вставить("ПринципалФИО", Контрагент.НаименованиеПолное);	
		СтруктураПараметров.Вставить("ПринципалАдрес", спПолучитьПредставление(Контрагент, Новый Структура("АдресЮридический")));
		СтруктураПараметров.Вставить("ПринципалПаспорт", ПаспортСерия + " " + ПаспортНомер);	
		СтруктураПараметров.Вставить("ПринципалВыдан", ПаспортКемВыдан);	
		СтруктураПараметров.Вставить("ПринципалДатаВыдачи", ПаспортДатаВыдачи);	
		СтруктураПараметров.Вставить("ПринципалКодПодразделения", ПаспортКодПодразделения);
		СтруктураПараметров.Вставить("ЦенаПоступления", ЦенаПоступления); 
	КонецЕсли;
	
	СтруктураПараметров.Вставить("НаименованиеПолное", Организация.НаименованиеПолное);    
	
	СтруктураПараметров.Вставить("VIN", Автомобиль.VIN);
	СтруктураПараметров.Вставить("ТипТС", "Легковой");
	СтруктураПараметров.Вставить("МаркаМодель", Автомобиль.Модель);
	СтруктураПараметров.Вставить("ГодИзготовления", Формат(Год(Автомобиль.ГодВыпуска), "ЧДЦ=0; ЧГ=0")); 
	СтруктураПараметров.Вставить("Двигатель", Автомобиль.НомерДвигателя);
	СтруктураПараметров.Вставить("Шасси", Автомобиль.НомерШасси); 
	СтруктураПараметров.Вставить("Кузов", Автомобиль.НомерКузова);
	СтруктураПараметров.Вставить("Цвет", Автомобиль.Цвет); 
	
	ЗапросПД.УстановитьПараметр("Владелец", Автомобиль);  	
	ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ВыпискаИзЭлектронногоПаспорта);
	РезультатЭПТС = ЗапросПД.Выполнить().Выбрать();
	
	Если РезультатЭПТС.Следующий() Тогда
		СтруктураПараметров.Вставить("ПТССерияНомер", РезультатЭПТС.Серия + ", " + РезультатЭПТС.Номер);
		СтруктураПараметров.Вставить("ПТСВыдано", РезультатЭПТС.КемВыдан + ", " + Формат(РезультатЭПТС.ДатаВыдачи, "ДФ=dd.MM.yyyy"));    
	Иначе
		ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.ПТС);
		РезультатПТС = ЗапросПД.Выполнить().Выбрать();
		
		Если РезультатПТС.Следующий() Тогда
			СтруктураПараметров.Вставить("ПТССерияНомер", РезультатПТС.Серия + ", " + РезультатПТС.Номер);
			СтруктураПараметров.Вставить("ПТСВыдано", РезультатПТС.КемВыдан + ", " + Формат(РезультатПТС.ДатаВыдачи, "ДФ=dd.MM.yyyy")); 	
		КонецЕсли;		
		
	КонецЕсли;		
	
	ЗапросПД.УстановитьПараметр("ВидПодтверждающегоДокумента", Перечисления.ВидыДокументов.Свидетельство);
	РезультатСТС = ЗапросПД.Выполнить().Выбрать();

	Если РезультатСТС.Следующий() Тогда
		СтруктураПараметров.Вставить("СТССерияНомер", РезультатСТС.Серия + ", " + РезультатСТС.Номер);
		СтруктураПараметров.Вставить("СТСВыдано", РезультатСТС.КемВыдан + ", " + Формат(РезультатСТС.ДатаВыдачи, "ДФ=dd.MM.yyyy"));
	КонецЕсли;		
	
	СтруктураПараметров.Вставить("НомернойЗнак", Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер,));			
	СтруктураПараметров.Вставить("СрокДоговора", ПолучитьСклоненияСтрокиПоЧислу("день", СрокДоговора,,, "ПД=Именительный")[0]); 
	СтруктураПараметров.Вставить("НаименованиеПолное", Организация.НаименованиеПолное);
	СтруктураПараметров.Вставить("АгентАдрес", спПолучитьПредставление(Организация, Новый Структура("АдресЮридический"))); 	
	СтруктураПараметров.Вставить("АгентИНН", Организация.ИНН);	
	СтруктураПараметров.Вставить("АгентОГРН", Организация.КПП);	
	СтруктураПараметров.Вставить("АгентРС", Организация.ОсновнойБанковскийСчет.НомерСчета);	
	СтруктураПараметров.Вставить("АгентКС", Организация.ОсновнойБанковскийСчет.Банк.КоррСчет);	
	СтруктураПараметров.Вставить("АгентБИК", Организация.ОсновнойБанковскийСчет.Банк.Код);	 
	СтруктураПараметров.Вставить("АгентТелефон", киПолучитьПредставлениеКИ(Организация,Справочники.ВидыКонтактнойИнформации.ТелефонРабочий));         
	
	АгентЭлПочта = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыРабочий);
	АгентЭлПочта1 = киПолучитьПредставлениеКИ(Организация, Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочтыДомашний);
	
	Если ЗначениеЗаполнено(АгентЭлПочта) Тогда
		СтруктураПараметров.Вставить("АгентЭлПочта", АгентЭлПочта + ?(ЗначениеЗаполнено(АгентЭлПочта1), ", " + АгентЭлПочта1, ""));
	Иначе
		СтруктураПараметров.Вставить("АгентЭлПочта", АгентЭлПочта1);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Поле4 КАК Город,
	|	КонтактнаяИнформация.Поле5 КАК НаселённыйПункт
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Вид В(&Вид)
	|	И КонтактнаяИнформация.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", ПодразделениеКомпании);
	ВидыАдресов = Новый Массив();
	ВидыАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресФактический);
	ВидыАдресов.Добавить(Справочники.ВидыКонтактнойИнформации.АдресПочтовый);
	Запрос.УстановитьПараметр("Вид", ВидыАдресов);
	Выборка = Запрос.Выполнить().Выбрать();  
	
	Если Выборка.Следующий() Тогда  
		
		Если ЗначениеЗаполнено(Выборка.Город) Тогда
			Город = "г. " + Лев(Выборка.Город, СтрДлина(Выборка.Город) - 2);
		ИначеЕсли ЗначениеЗаполнено(Выборка.НаселённыйПункт) Тогда
			Город = "п. " + Лев(Выборка.НаселённыйПункт, СтрДлина(Выборка.НаселённыйПункт) - 2);
		Иначе
			Город = "";
		КонецЕсли; 
		
		СтруктураПараметров.Вставить("Город", Город);
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ПодписьПродавца", Автор);	
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура ЗаполнитьСвойстваТабДока(ТабДокумент, ДвусторонняяПечать)
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 10;
	ТабДокумент.ПолеСнизу  = 12;
	ТабДокумент.ПолеСправа = 5;  
	ТабДокумент.НижнийКолонтитул.ТекстСлева = "Принципал: _______________"; 
	ТабДокумент.НижнийКолонтитул.ТекстСправа = "Агент: _______________";
	ТабДокумент.НижнийКолонтитул.Выводить = Истина;		
	ТабДокумент.ДвусторонняяПечать = ДвусторонняяПечать;  
	ТабДокумент.АвтоМасштаб = Истина;	
	ТабДокумент.ОтображатьСетку = Ложь;
	ТабДокумент.ТолькоПросмотр = Истина;
 КонецПроцедуры

Функция ПечатьДоговораКомиссии() Экспорт 
	ТабДокумент = Новый ТабличныйДокумент();  
	СтруктураПараметров = ПолучитьСтруктуру();
	Макет = ПолучитьМакет("Договор");  
	ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров);	
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка")); 
	
	Для Счетчик = 1 По 12 Цикл  
		ТекущаяОбласть = Макет.ПолучитьОбласть("П" + Строка(Счетчик)); 
		
		Если Счетчик = 12 И Не ТабДокумент.ПроверитьВывод(ТекущаяОбласть) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;   
		
		ТабДокумент.Вывести(ТекущаяОбласть);	
	КонецЦикла;  
	
	//Холышевская 20260203 ++		
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
	//Холышевская 20260203 --	
	
	ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.ПереворотВлево);
	
	Возврат ТабДокумент;   		
	
КонецФункции  

Функция ПечатьПриложения1() Экспорт 
	
	ТабДокумент = Новый ТабличныйДокумент();  
	СтруктураПараметров = ПолучитьСтруктуру();
	Макет = ПолучитьМакет("Приложение1");
	ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров); 
	ТабДокумент.Вывести(Макет); 
	//Холышевская 20260203 ++		
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
	//Холышевская 20260203 --
	ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.Нет);  
	
	Возврат ТабДокумент;   	
	
КонецФункции   

Функция ПечатьПриложения2() Экспорт 
	ТабДокумент = Новый ТабличныйДокумент();  
	СтруктураПараметров = ПолучитьСтруктуру();
	Макет = ПолучитьМакет("Приложение2");
	ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров); 
	ТабДокумент.Вывести(Макет);   
	//Холышевская 20260203 ++		
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
	//Холышевская 20260203 --
	ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.Нет);  
	
	Возврат ТабДокумент; 
	
КонецФункции   	

Функция ПечатьПриложения4() Экспорт 
	ТабДокумент = Новый ТабличныйДокумент();  
	СтруктураПараметров = ПолучитьСтруктуру();
	Макет = ПолучитьМакет("Приложение4");
	ЗаполнитьЗначенияСвойств(Макет.Параметры, СтруктураПараметров); 
	ТабДокумент.Вывести(Макет); 
	//Холышевская 20260203 ++		
	ТабДокумент.ПовторятьПриПечатиСтроки = ТабДокумент.Область(1,, 1); 
	//Холышевская 20260203 --
	ЗаполнитьСвойстваТабДока(ТабДокумент, ТипДвустороннейПечати.Нет);  
	
	Возврат ТабДокумент;   	
	
КонецФункции

//Иванченко 20260217 ++
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры
//Иванченко 20260217 --
